#+TITLE: cons is weird

=cons= means "construct"

=car= - address register

=cdr= - document register

#+begin_src emacs-lisp
  (cons (list 1 2) (list 3 4))
#+end_src

#+RESULTS:
| (1 2) | 3 | 4 |

#+begin_src emacs-lisp
  (cons (cons 1 2) (cons 3 4))
#+end_src

#+RESULTS:
: ((1 . 2) 3 . 4)

#+begin_src emacs-lisp
  (cons (cons 1 (cons 2 3)) 4)
#+end_src

#+RESULTS:
: ((1 2 . 3) . 4)

#+begin_src emacs-lisp
  (cons (cons 1 2) (cons (cons 3 4) nil))
#+end_src

#+RESULTS:
: ((1 . 2) (3 . 4))
